#todo: Определить в коде  переменные:

#1. Целочисленного типа
#int
x = 1
print(type(x))
#2. Вещественного типа
#float
y = 12.5 
print(type(y))
#3. Логического типа
#bool
flag = False
flag_1 = True
print(type(flag ))
#4. Строкового типа
#str
a = "Время приключений"
print(type(a))
#5. Пустого типа
#NoneType
z = None

print(type(z))
#Вывести все их типы.


