#todo: Определить в коде  переменные:

#1. Целочисленного типа
#int
x = 1
print(type(x))
#2. Вещественного типа
#float
y = 12.5 
print(type(y))
#3. Логического типа
#4. Строкового типа
#5. Пустого типа

#Вывести все их типы.


